Tekla Open API Reference for Tekla Structures 2025
PointCloud Properties
The PointCloud type exposes the following members.
Properties
Name | Description
BoundingBox
 Gets or sets the bounding box.
Guid
 Gets or sets the guid.
LocationBy
 Gets or sets the location by value: Empty for model origin, base point guid for base point.
Name
 Gets or sets the point clouds name. Abbreviated from the point cloud file name. Cannot be given by user.
OffsetX
 Gets or sets the offset X.
OffsetY
 Gets or sets the offset Y.
OffsetZ
 Gets or sets the offset Z.
OriginalPath
 Gets or sets the point clouds path (where it originally located).
RotationZ
 Gets or sets the rotation Z.
Scale
 Gets or sets the scale.
Url
 Gets or sets the point clouds URL without a file name.
UseAutoCreatedBasePoint
 Gets or sets a value indicating whether an auto-created base point should be used. If set to true, LocationBy value is ignored.
Top
See Also
Reference
PointCloud Class
Tekla.Structures.Model Namespace